benchmark_results/20260202_233400/test4_feed_page1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /users/me/feed?count=20&cursor=0
Document Length:        46 bytes

Concurrency Level:      10
Time taken for tests:   0.007 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      18700 bytes
HTML transferred:       4600 bytes
Requests per second:    13424.62 [#/sec] (mean)
Time per request:       0.745 [ms] (mean)
Time per request:       0.074 [ms] (mean, across all concurrent requests)
Transfer rate:          2451.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     0    0   0.1      0       1
Waiting:        0    0   0.1      0       1
Total:          0    1   0.1      1       1

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%      1 (longest request)